{
    "_class_name": "ZImagePipeline",
    "_diffusers_version": "0.36.0.dev0",
    "scheduler": [
        "diffusers",
        "FlowMatchEulerDiscreteScheduler"
    ],
    "text_encoder": [
        "transformers",
        "Qwen3Model"
    ],
    "tokenizer": [
        "transformers",
        "Qwen2Tokenizer"
    ],
    "transformer": [
        "diffusers",
        "ZImageTransformer2DModel"
    ],
    "vae": [
        "diffusers",
        "AutoencoderKL"
    ]
}